bench/results/server1/2/apiary-0.15.1/AFTER_DEEP.log
Benchmarking AFTER_DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.12ms  778.57us  16.26ms   65.98%
    Req/Sec    33.90k     2.95k   54.89k    74.27%
  1914561 requests in 30.00s, 224.58MB read
Requests/sec:  63818.62
Transfer/sec:      7.49MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.14ms    0.86ms  14.61ms   59.15%
    Req/Sec    33.77k     3.24k   58.67k    73.42%
  1904445 requests in 30.00s, 223.40MB read
Requests/sec:  63482.03
Transfer/sec:      7.45MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.19ms    1.05ms  13.85ms   62.91%
    Req/Sec    33.45k     4.54k   52.33k    64.36%
  1888307 requests in 30.00s, 221.50MB read
Requests/sec:  62943.83
Transfer/sec:      7.38MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.03ms  553.05us  36.14ms   91.98%
    Req/Sec    34.91k     3.52k   61.10k    71.70%
  1969971 requests in 30.00s, 231.08MB read
Requests/sec:  65664.66
Transfer/sec:      7.70MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.22ms    0.85ms  13.31ms   68.98%
    Req/Sec    33.23k     4.18k   60.00k    68.20%
  1875835 requests in 30.00s, 220.04MB read
Requests/sec:  62528.10
Transfer/sec:      7.33MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.12ms    0.94ms  14.71ms   68.43%
    Req/Sec    33.84k     3.25k   65.67k    73.96%
  1908206 requests in 30.00s, 223.84MB read
Requests/sec:  63607.15
Transfer/sec:      7.46MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.13ms    1.05ms  15.61ms   59.65%
    Req/Sec    33.87k     3.47k   70.00k    74.70%
  1908400 requests in 30.00s, 223.86MB read
Requests/sec:  63613.09
Transfer/sec:      7.46MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.09ms    1.06ms  14.34ms   58.43%
    Req/Sec    34.29k     3.45k   71.22k    71.74%
  1933070 requests in 30.00s, 226.75MB read
Requests/sec:  64436.04
Transfer/sec:      7.56MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.13ms  719.03us  31.21ms   68.64%
    Req/Sec    33.84k     3.43k   69.78k    75.06%
  1908829 requests in 30.00s, 223.91MB read
Requests/sec:  63626.88
Transfer/sec:      7.46MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.13ms    1.22ms  17.98ms   79.41%
    Req/Sec    33.89k     3.38k   71.56k    75.11%
  1911356 requests in 30.00s, 224.21MB read
Requests/sec:  63712.22
Transfer/sec:      7.47MB
=================== summary ===================
ghc version:  7.8.2
bench target: apiary-0.15.1
bench:        AFTER_DEEP
bench mode:   30s * 10
average:      63743.26
stdev:        844.02
=================== oneline ===================
7.8.2,apiary-0.15.1,AFTER_DEEP,30s,10,63743.26,844.02